fio/log/ext4_5th_random_read_log.txt
fio_test: (g=0): rw=randread, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
...
fio-2.16-35-g8c4e
Starting 8 threads

fio_test: (groupid=0, jobs=1): err= 0: pid=11352: Thu Jan 19 11:05:26 2017
   read: IOPS=19.9k, BW=77.6MiB/s (81.3MB/s)(800GiB/10571600msec), iops=20377, runt=
    slat (usec): min=1, max=32208, avg= 3.48, stdev=29.09
    clat (usec): min=23, max=53736, avg=6447.98, stdev=6785.96
     lat (usec): min=326, max=53739, avg=6451.47, stdev=6785.95
    clat percentiles (usec):
     |  1.00th=[ 1048],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1192],
     | 30.00th=[ 1368], 40.00th=[ 1720], 50.00th=[ 2320], 60.00th=[ 3632],
     | 70.00th=[ 8640], 80.00th=[16192], 90.00th=[17792], 95.00th=[18816],
     | 99.00th=[20096], 99.50th=[20352], 99.90th=[21376], 99.95th=[21888],
     | 99.99th=[23936]
    lat (usec) : 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=45.35%, 4=15.95%, 10=10.28%, 20=27.25%, 50=1.15%
    lat (msec) : 100=0.01%
  cpu          : usr=4.39%, sys=7.94%, ctx=159959042, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=209715200,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=11353: Thu Jan 19 11:05:26 2017
   read: IOPS=19.1k, BW=77.1MiB/s (81.8MB/s)(800GiB/10511058msec), iops=19558, runt=
    slat (usec): min=1, max=33864, avg= 3.50, stdev=29.04
    clat (usec): min=19, max=87755, avg=6411.02, stdev=6779.36
     lat (usec): min=339, max=87758, avg=6414.52, stdev=6779.36
    clat percentiles (usec):
     |  1.00th=[ 1048],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1192],
     | 30.00th=[ 1368], 40.00th=[ 1704], 50.00th=[ 2288], 60.00th=[ 3536],
     | 70.00th=[ 8512], 80.00th=[16064], 90.00th=[17792], 95.00th=[18816],
     | 99.00th=[20096], 99.50th=[20352], 99.90th=[21376], 99.95th=[21888],
     | 99.99th=[23936]
    lat (usec) : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=45.67%, 4=15.98%, 10=10.10%, 20=27.09%, 50=1.14%
    lat (msec) : 100=0.01%
  cpu          : usr=4.41%, sys=8.04%, ctx=159821249, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=209715200,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=11354: Thu Jan 19 11:05:26 2017
   read: IOPS=19.8k, BW=77.4MiB/s (81.6MB/s)(800GiB/10597380msec), iops=20275, runt=
    slat (usec): min=1, max=28549, avg= 3.48, stdev=29.21
    clat (usec): min=24, max=49552, avg=6463.72, stdev=6789.42
     lat (usec): min=324, max=49558, avg=6467.20, stdev=6789.42
    clat percentiles (usec):
     |  1.00th=[ 1048],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1192],
     | 30.00th=[ 1384], 40.00th=[ 1736], 50.00th=[ 2352], 60.00th=[ 3664],
     | 70.00th=[ 8640], 80.00th=[16192], 90.00th=[17792], 95.00th=[18816],
     | 99.00th=[20096], 99.50th=[20352], 99.90th=[21376], 99.95th=[21888],
     | 99.99th=[24192]
    lat (usec) : 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=45.04%, 4=16.15%, 10=10.34%, 20=27.28%, 50=1.17%
  cpu          : usr=4.36%, sys=7.94%, ctx=159947281, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=209715200,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=11355: Thu Jan 19 11:05:26 2017
   read: IOPS=19.9k, BW=77.6MiB/s (81.3MB/s)(800GiB/10568145msec), iops=20377, runt=
    slat (usec): min=1, max=35334, avg= 3.49, stdev=29.12
    clat (usec): min=2, max=40937, avg=6445.85, stdev=6785.56
     lat (usec): min=313, max=40943, avg=6449.33, stdev=6785.56
    clat percentiles (usec):
     |  1.00th=[ 1048],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1192],
     | 30.00th=[ 1368], 40.00th=[ 1720], 50.00th=[ 2320], 60.00th=[ 3632],
     | 70.00th=[ 8640], 80.00th=[16064], 90.00th=[17792], 95.00th=[18816],
     | 99.00th=[20096], 99.50th=[20352], 99.90th=[21376], 99.95th=[21888],
     | 99.99th=[23936]
    lat (usec) : 4=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=45.37%, 4=15.94%, 10=10.29%, 20=27.23%, 50=1.15%
  cpu          : usr=4.42%, sys=7.95%, ctx=159845994, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=209715200,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=11356: Thu Jan 19 11:05:26 2017
   read: IOPS=20.2k, BW=78.7MiB/s (82.5MB/s)(800GiB/10414086msec), iops=20684, runt=
    slat (usec): min=1, max=28042, avg= 3.50, stdev=28.88
    clat (usec): min=7, max=49680, avg=6351.84, stdev=6757.43
     lat (usec): min=323, max=49687, avg=6355.34, stdev=6757.42
    clat percentiles (usec):
     |  1.00th=[ 1048],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1192],
     | 30.00th=[ 1368], 40.00th=[ 1704], 50.00th=[ 2256], 60.00th=[ 3472],
     | 70.00th=[ 8096], 80.00th=[16064], 90.00th=[17792], 95.00th=[18816],
     | 99.00th=[20096], 99.50th=[20352], 99.90th=[21376], 99.95th=[21888],
     | 99.99th=[23936]
    lat (usec) : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=45.91%, 4=16.13%, 10=10.18%, 20=26.62%, 50=1.14%
  cpu          : usr=4.45%, sys=8.09%, ctx=159653236, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=209715200,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=11357: Thu Jan 19 11:05:26 2017
   read: IOPS=19.8k, BW=77.4MiB/s (81.7MB/s)(800GiB/10596149msec), iops=20275, runt=
    slat (usec): min=1, max=32513, avg= 3.49, stdev=29.09
    clat (usec): min=21, max=46549, avg=6462.96, stdev=6789.63
     lat (usec): min=348, max=46553, avg=6466.45, stdev=6789.62
    clat percentiles (usec):
     |  1.00th=[ 1048],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1192],
     | 30.00th=[ 1384], 40.00th=[ 1736], 50.00th=[ 2320], 60.00th=[ 3664],
     | 70.00th=[ 8640], 80.00th=[16192], 90.00th=[17792], 95.00th=[18816],
     | 99.00th=[20096], 99.50th=[20352], 99.90th=[21376], 99.95th=[21888],
     | 99.99th=[23936]
    lat (usec) : 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=45.05%, 4=16.15%, 10=10.34%, 20=27.29%, 50=1.16%
  cpu          : usr=4.39%, sys=7.91%, ctx=159922971, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=209715200,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=11358: Thu Jan 19 11:05:26 2017
   read: IOPS=19.1k, BW=77.9MiB/s (81.7MB/s)(800GiB/10518915msec), iops=19558, runt=
    slat (usec): min=1, max=37539, avg= 3.48, stdev=28.82
    clat (usec): min=16, max=49545, avg=6415.85, stdev=6778.44
     lat (usec): min=352, max=49549, avg=6419.33, stdev=6778.43
    clat percentiles (usec):
     |  1.00th=[ 1048],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1192],
     | 30.00th=[ 1368], 40.00th=[ 1704], 50.00th=[ 2288], 60.00th=[ 3568],
     | 70.00th=[ 8512], 80.00th=[16064], 90.00th=[17792], 95.00th=[18816],
     | 99.00th=[20096], 99.50th=[20352], 99.90th=[21376], 99.95th=[21888],
     | 99.99th=[23936]
    lat (usec) : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=45.55%, 4=16.03%, 10=10.15%, 20=27.11%, 50=1.14%
  cpu          : usr=4.40%, sys=7.99%, ctx=159903033, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=209715200,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=11359: Thu Jan 19 11:05:26 2017
   read: IOPS=19.8k, BW=77.3MiB/s (81.5MB/s)(800GiB/10599350msec), iops=20275, runt=
    slat (usec): min=1, max=24902, avg= 3.49, stdev=29.14
    clat (usec): min=24, max=49107, avg=6464.92, stdev=6793.39
     lat (usec): min=327, max=49110, avg=6468.41, stdev=6793.39
    clat percentiles (usec):
     |  1.00th=[ 1048],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1192],
     | 30.00th=[ 1384], 40.00th=[ 1736], 50.00th=[ 2320], 60.00th=[ 3664],
     | 70.00th=[ 8768], 80.00th=[16192], 90.00th=[17792], 95.00th=[18816],
     | 99.00th=[20096], 99.50th=[20352], 99.90th=[21376], 99.95th=[21888],
     | 99.99th=[23936]
    lat (usec) : 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%, 750=0.03%
    lat (usec) : 1000=0.14%
    lat (msec) : 2=44.95%, 4=16.08%, 10=10.32%, 20=27.31%, 50=1.17%
  cpu          : usr=4.37%, sys=7.91%, ctx=159773325, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=209715200,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=618MiB/s (648MB/s), 77.3MiB/s-78.7MiB/s (81.5MB/s-82.5MB/s), io=6400GiB (6872GB), run=10414086-10599350msec

Disk stats (read/write):
  nvme0n1: ios=1677693914/6, merge=0/2, ticks=2124664012/6, in_queue=2221843578, util=100.00%